src/Catalogs/ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВариантыОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Администратор</Name>
					<Comment>Автор варианта отчета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Видимость</Name>
					<Comment>Вариант видим всем пользователям по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидимостьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидимостьПоУмолчаниюПереопределена</Name>
					<Comment>Когда Истина то вместо флажка ВидимостьПоУмолчанию используется значение аналогичного флажка предопределенного варианта отчета.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтерактивнаяПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевыеСлова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованияПараметровИОтборов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВариант</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Comment>АПК:1329 - в таблице предполагается мало записей (в ERP ~ 1200) - оптимизация не требуется</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользовательский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредопределенныйВариант</Name>
					<Comment>Вариант конфигурации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредопределенныеВариантыОтчетовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ПредопределенныеВариантыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВариантаОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВариантовОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляАвтора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкаВидимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РольПользователя</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подсистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсистема</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предопределенная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Размещение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсистема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Важный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СмТакже</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/НастройкиВариантовОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиВариантовОтчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Видимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БыстрыйДоступ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Образец</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Теги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рекомендуемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФункциональнаяОпция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Устаревший</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИзмененаПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольПользователя</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подсистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Требуется для подключения команд дополнительных отчетов и обработок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Внутренний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дополнительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расширение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внешний</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВариантыОтчетов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При чтении на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	ПользователиВарианта = ВернутьНастройкиДоступностиВариантаОтчета(ТекущийОбъект.Ссылка);
	
	ЗаполнитьИзПредопределенного(ТекущийОбъект);
    ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");

	Элементы.ГруппаИспользования.Доступность 				= НЕ ТекущийОбъект.ПометкаУдаления И ДоступноАдминистрированиеОтчетов;
	Элементы.ГруппаПодсистемы.Доступность 					= НЕ ТекущийОбъект.ПометкаУдаления И ПравоНаЭтотВариант;
	Элементы.НастроитьВидимостьПользователей.Доступность 	= НЕ ТекущийОбъект.ПометкаУдаления И ДоступноАдминистрированиеОтчетов;
	Элементы.НастроитьПодсистемы.Доступность 				= НЕ ТекущийОбъект.ПометкаУдаления И ПравоНаЭтотВариант;
	
	Элементы.Автор.ТолькоПросмотр 							= НЕ ПолныеПраваНаВарианты ИЛИ ТекущийОбъект.ПометкаУдаления;
	
	Если ТекущийОбъект.ПометкаУдаления Тогда 
		//Элементы.ГруппаКнопкиСохранить.ЦветФона 			= Новый Цвет(73, 195, 125);
		Элементы.ФормаКнопкаСохранитьИЗакрыть.ЦветТекста 	= Новый Цвет(255, 255, 255);
		Элементы.ФормаКнопкаСохранитьИЗакрыть.Заголовок 	= НСтр("ru = 'Восстановить';en = 'Recover'");
		КомандаВосстановить = ЭтаФорма.Команды.Найти("ЗаписатьИЗакрыть");
		Если НЕ КомандаВосстановить = Неопределено Тогда 
			КомандаВосстановить.Подсказка = НСтр("ru = 'Восстановить вариант отчета';en = 'Restore a report option'");
		КонецЕсли;	
	Иначе 
		//Элементы.ГруппаКнопкиСохранить.ЦветФона 			= Новый Цвет(255, 215, 40);
		Элементы.ФормаКнопкаСохранитьИЗакрыть.ЦветТекста 	= Новый Цвет(255, 255, 255);
		Элементы.ФормаКнопкаСохранитьИЗакрыть.Заголовок 	= НСтр("ru = 'Сохранить';en = 'Save'");
		КомандаЗаписатьИЗакрыть = ЭтаФорма.Команды.Найти("ЗаписатьИЗакрыть");		
		Если НЕ КомандаЗаписатьИЗакрыть = Неопределено Тогда 
			КомандаЗаписатьИЗакрыть.Подсказка = НСтр("ru = 'Сохранить вариант отчета и закрыть форму';en = 'Save the report option and close the form'");
		КонецЕсли;			
	КонецЕсли;
	Элементы.ПометитьНаУдаление.Видимость 					= НЕ ТекущийОбъект.ПометкаУдаления И ТекущийОбъект.Пользовательский;
	//Элементы.ГруппаКнопкиУдаления.ЦветФона 					= ?(ПравоНаЭтотВариант, Элементы.ГруппаКнопкиУдаления.ЦветФона, Новый Цвет(247, 247, 247));	
	
КонецПроцедуры

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Доступен = ?(Объект.ТолькоДляАвтора, "ТолькоДляАвтора", "УказаннымПользователям");
	ДоступноАдминистрированиеОтчетов = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("АдминистрированиеОтчетов");
	
	ПолныеПраваНаВарианты = ВариантыОтчетов.ПолныеПраваНаВарианты();
	ПравоНаЭтотВариант = (ПолныеПраваНаВарианты И Объект.Автор = Пользователи.АвторизованныйПользователь()) ИЛИ ДоступноАдминистрированиеОтчетов;
	Если НЕ ПравоНаЭтотВариант Тогда
		ТолькоПросмотр = Истина;
		Элементы.ГруппаПодсистемы.Доступность 				= Ложь;
		Элементы.НастроитьПодсистемы.Доступность 			= Ложь;		
	КонецЕсли;
	
	Элементы.ГруппаКнопкиУдаления.Доступность 				= ПравоНаЭтотВариант;
	Если Объект.ПометкаУдаления Тогда 
		Элементы.ФормаКнопкаСохранитьИЗакрыть.Доступность 	= ПравоНаЭтотВариант;		
		//Элементы.ГруппаКнопкиСохранить.ЦветФона 			= ?(ПравоНаЭтотВариант, Новый Цвет(73, 195, 125), Новый Цвет(247, 247, 247));
		Элементы.ФормаКнопкаСохранитьИЗакрыть.ЦветТекста 	= ?(ПравоНаЭтотВариант, Новый Цвет(255, 255, 255), Новый Цвет());
		Элементы.ФормаКнопкаСохранитьИЗакрыть.Заголовок 	= НСтр("ru = 'Восстановить';en = 'Recover'");
		КомандаВосстановить = ЭтаФорма.Команды.Найти("ЗаписатьИЗакрыть");
		Если НЕ КомандаВосстановить = Неопределено Тогда 
			КомандаВосстановить.Подсказка = НСтр("ru = 'Восстановить вариант отчета';en = 'Restore a report option'");
		КонецЕсли;			
	Иначе
		Элементы.ФормаКнопкаСохранитьИЗакрыть.Доступность 	= Истина;
		//Элементы.ГруппаКнопкиСохранить.ЦветФона 			= Новый Цвет(255, 215, 40);
		Элементы.ФормаКнопкаСохранитьИЗакрыть.ЦветТекста 	= Новый Цвет(255, 255, 255);
		Элементы.ФормаКнопкаСохранитьИЗакрыть.Заголовок 	= НСтр("ru = 'Сохранить';en = 'Save'");
		КомандаЗаписатьИЗакрыть = ЭтаФорма.Команды.Найти("ЗаписатьИЗакрыть");		
		Если НЕ КомандаЗаписатьИЗакрыть = Неопределено Тогда 
			КомандаЗаписатьИЗакрыть.Подсказка = НСтр("ru = 'Сохранить вариант отчета и закрыть форму';en = 'Save the report option and close the form'");
		КонецЕсли;					
	КонецЕсли;	
	//Элементы.ГруппаКнопкиУдаления.ЦветФона 				= ?(ПравоНаЭтотВариант, Элементы.ГруппаКнопкиУдаления.ЦветФона, Новый Цвет(247, 247, 247));	
	Элементы.ПометитьНаУдаление.Доступность 				= ПравоНаЭтотВариант;
	
	Если НЕ Объект.Пользовательский Тогда
		Элементы.Наименование.ТолькоПросмотр 				= Истина;
		Элементы.Описание.ТолькоПросмотр 					= Истина;
		Элементы.Автор.ТолькоПросмотр 						= Истина;
		Элементы.Автор.АвтоОтметкаНезаполненного 			= Ложь;
		Элементы.ПометитьНаУдаление.Видимость 				= Ложь;
	КонецЕсли;

	Элементы.ГруппаИспользования.Доступность 				= НЕ Объект.ПометкаУдаления И ДоступноАдминистрированиеОтчетов;
	Элементы.ГруппаПодсистемы.Доступность 					= НЕ Объект.ПометкаУдаления И ПравоНаЭтотВариант;
	Элементы.НастроитьВидимостьПользователей.Доступность 	= НЕ Объект.ПометкаУдаления И ДоступноАдминистрированиеОтчетов;
	Элементы.НастроитьПодсистемы.Доступность 				= НЕ Объект.ПометкаУдаления И ПравоНаЭтотВариант;
	
	ЭтоВнешний = (Объект.ТипОтчета = Перечисления.ТипыОтчетов.Внешний);
	Если ЭтоВнешний Тогда
		Элементы.ГруппаПодсистемы.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Элементы.Автор.ТолькоПросмотр = НЕ ПолныеПраваНаВарианты ИЛИ Объект.ПометкаУдаления;
	
	// Заполнение имени отчета для команды "Просмотр".
	Если Объект.ТипОтчета = Перечисления.ТипыОтчетов.Внутренний
		ИЛИ Объект.ТипОтчета = Перечисления.ТипыОтчетов.Расширение Тогда
		ИмяОтчета = Объект.Отчет.Имя;
	ИначеЕсли Объект.ТипОтчета = Перечисления.ТипыОтчетов.Дополнительный Тогда
		ИмяОтчета = Объект.Отчет.ИмяОбъекта;
	Иначе
		ИмяОтчета = Объект.Отчет;
	КонецЕсли;
	
	ПерезаполнитьДерево(Ложь);
	СписокПользователей = "";
	СписокПодсистем     = "";	
	Элементы.НастроитьВидимостьПользователей.Заголовок = ОписаниеПользователей();
	Элементы.НастроитьПодсистемы.Заголовок    = ОписаниеПодсистем();

	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаСервере
// Процедура - Перед записью на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Запись свойств, связанных с предопределенным вариантом отчета.
	ОписаниеИзменено = Ложь;
	Если ЭтоПредопределенный Тогда
		
		ПредопределенныйВариант = ТекущийОбъект.ПредопределенныйВариант.ПолучитьОбъект();
		МультиязычностьСервер.ПриЧтенииПредставленийНаСервере(ПредопределенныйВариант);
		
		ОписаниеИзменено = Не ПустаяСтрока(Объект.Описание) И НРег(СокрЛП(Объект.Описание)) <> НРег(СокрЛП(ПредопределенныйВариант.Описание));
		Если Не ОписаниеИзменено Тогда
			ТекущийОбъект.Описание = "";
			Для каждого ПредставлениеВарианта Из ТекущийОбъект.Представления Цикл 
				ПредставлениеВарианта.Описание = "";
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	// Запись дерева подсистем.
	ДеревоПриемник = РеквизитФормыВЗначение("ДеревоПодсистем", Тип("ДеревоЗначений"));
	Если ТекущийОбъект.ЭтоНовый() Тогда
		ИзмененныеРазделы = ДеревоПриемник.Строки.НайтиСтроки(Новый Структура("Использование", 1), Истина);
	Иначе
		ИзмененныеРазделы = ДеревоПриемник.Строки.НайтиСтроки(Новый Структура("Модифицированность", Истина), Истина);
	КонецЕсли;
	ВариантыОтчетов.ДеревоПодсистемЗаписать(ТекущийОбъект, ИзмененныеРазделы);
	
	МультиязычностьСервер.ПередЗаписьюНаСервере(ТекущийОбъект);
	Если ЭтоПредопределенный И Не ОписаниеИзменено Тогда
		ТекущийОбъект.Представления.Очистить();
	КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ПользователиВарианта", ПользователиВариантаРедактирование);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("УстанавливатьПоПометке", ЗначениеЗаполнено(ПользователиВариантаРедактирование));

КонецПроцедуры

&НаСервере
// Процедура - При записи на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

&НаСервере
// Процедура - После записи на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьИзПредопределенного(ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
// Процедура - После записи
//
// Параметры:
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ВариантыОтчетовКлиент.ОбновитьОткрытыеФормы(Объект.Ссылка, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьВидимостьПользователей(Команда)
	
	//ПользователиВарианта = ВернутьНастройкиДоступностиВариантаОтчета(Объект.Ссылка);

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВариантОтчета"						, Объект.Ссылка);
	ПараметрыФормы.Вставить("Пользователи"						, ПользователиВарианта);
	ПараметрыФормы.Вставить("ПользователиВариантаРедактирование", ПользователиВариантаРедактирование);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РезультатВыбораВариантыОтчетовФормаРедактированиеВидимости", ЭтаФорма);
	ОткрытьФорму("Справочник.ВариантыОтчетов.Форма.РедактированиеВидимости", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, 
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПодсистемы(Команда)
	
	ПараметрыФормы = Новый Структура("ДеревоПодсистем", ДеревоПодсистем);
	ОписаниеОповещения = Новый ОписаниеОповещения("РезультатВыбораВариантыОтчетовФормаРедактированиеПодсистемы", ЭтаФорма);
	ОткрытьФорму("Справочник.ВариантыОтчетов.Форма.РедактированиеПодсистемы", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

&НаКлиенте
// Процедура - Пометить на удаление снять пометку
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПометитьНаУдалениеСнятьПометку(Команда)
	
	ОповещениеДиалога = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПометкаУдаления", ЭтотОбъект);
	Если Объект.ПометкаУдаления Тогда 
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Снять с ""%1"" пометку на удаление?';en = 'Uncheck %1 for deletion?'"), Строка(Объект.Ссылка));	
	Иначе 
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Пометить ""%1"" на удаление?';en = 'Mark %1 for deletion?'"), Строка(Объект.Ссылка));	
	КонецЕсли;
	
	ПоказатьВопрос(ОповещениеДиалога, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);

КонецПроцедуры

&НаКлиенте
// Процедура - Записать и закрыть
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если Объект.ПометкаУдаления Тогда 
		ОповещениеДиалога = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПометкаУдаления", ЭтотОбъект);
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Снять с ""%1"" пометку на удаление?';en = 'Uncheck %1 for deletion?'"), Строка(Объект.Ссылка));	
	
		ПоказатьВопрос(ОповещениеДиалога, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Иначе 
		ЭтаФорма.Записать();
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - После закрытия вопроса пометка удаления
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеЗакрытияВопросаПометкаУдаления(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда 
		Объект.ПометкаУдаления = НЕ Объект.ПометкаУдаления;
		ЭтаФорма.Записать();
		Если Объект.ПометкаУдаления Тогда 
			ЭтаФорма.Закрыть();
		Иначе 	
			ЭтаФорма.Прочитать();
		КонецЕсли;	
    КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Вернуть настройки доступности варианта отчета
//
// Параметры:
//  ВариантОтчета						 - 	 - 
//  ПользователиВариантаРедактирование	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьНастройкиДоступностиВариантаОтчета(ВариантОтчета, ПользователиВариантаРедактирование = Неопределено)
	
	Возврат РегистрыСведений.НастройкиВариантовОтчетов.ПрочитатьНастройкиДоступностиВариантаОтчета2(ВариантОтчета, ПользователиВариантаРедактирование);
	
КонецФункции

Функция ОписаниеПользователей()
		
	Если ПользователиВарианта.Количество() = 0 Тогда
		ОписаниеПользователя = "Все пользователи";
	Иначе
		ОписаниеПользователя = "";
		Для каждого СтрокаПользователя Из ПользователиВарианта Цикл
			ОписаниеПользователя = ОписаниеПользователя + СтрокаПользователя.Представление + ", ";
		КонецЦикла;
		ОписаниеПользователя = Лев(ОписаниеПользователя, СтрДлина(ОписаниеПользователя)-2);
	КонецЕсли;

	Возврат ОписаниеПользователя;
	
КонецФункции

Функция ОписаниеПодсистем()
	
	СписокПодсистем = "";
		
	ДеревоЗнач = РеквизитФормыВЗначение("ДеревоПодсистем");
	ОбойтиУровеньДерева(ДеревоЗнач.Строки, СписокПодсистем);   
	
	Если СписокПодсистем = "" Тогда
		СписокПодсистем = "Раздел не выбран"
	КонецЕсли;
	
	Возврат СписокПодсистем;
	
КонецФункции

Процедура ОбойтиУровеньДерева(Строки, СписокПодсистем = "")
	
	Для Каждого Строка Из Строки Цикл
		
		Если Строка.Использование = 1 Тогда
			СписокПодсистем = СписокПодсистем + ?(ЗначениеЗаполнено(СписокПодсистем), ", ", "") + Строка.Представление;  
		КонецЕсли;
        ОбойтиУровеньДерева(Строка.Строки, СписокПодсистем);
		
 	КонецЦикла;
 
КонецПроцедуры

Процедура ДобавитьДеревоПодсистем(Подсистема, СтрокаПодсистемы, СписокПодсистем)
	
	//Для каждого ПодсистемаПодчиненная из Подсистема.Подсистемы Цикл
	//	
	//	Если Не ПодсистемаПодчиненная.ВключатьВКомандныйИнтерфейс тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	СтрокаПодсистемыПодчиненой               = СтрокаПодсистемы.ПолучитьЭлементы().Добавить();
	//	СтрокаПодсистемыПодчиненой.Название      = ПодсистемаПодчиненная.Синоним;
	//	МассивСтрок                              = Подсистемы.НайтиСтроки(Новый Структура("Подсистема", СтрокаПодсистемы.ПутьКПодсистеме + "\" + ПодсистемаПодчиненная.Имя));
	//	СтрокаПодсистемыПодчиненой.Использование = МассивСтрок.Количество() > 0;
	//	Если СтрокаПодсистемыПодчиненой.Использование тогда
	//		СписокПодсистем = СписокПодсистем + ПодсистемаПодчиненная.Синоним + ", ";
	//		СтрокаПодсистемыПодчиненой.Предопределенная = МассивСтрок[0].Предопределенная;
	//	КонецЕсли;
	//	СтрокаПодсистемыПодчиненой.ПутьКПодсистеме = СтрокаПодсистемы.ПутьКПодсистеме + "\" + ПодсистемаПодчиненная.Имя;
	//	ДобавитьДеревоПодсистем(ПодсистемаПодчиненная, СтрокаПодсистемыПодчиненой, СписокПодсистем);
	//	
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьДеревозначенийВформу(ДеревоПодсистем)
	
	ДеревоПодсистемЗначение = ДанныеФормыВЗначение(ДеревоПодсистем, Тип("ДеревоЗначений"));
	ЗначениеВРеквизитФормы(ДеревоПодсистемЗначение, "ДеревоПодсистем");
	
КонецПроцедуры 

&НаСервере
Функция ПерезаполнитьДерево(Прочитать)
	//ВыделенныеСтроки = ОтчетыСервер.ЗапомнитьВыделенныеСтроки(ЭтотОбъект, "ДеревоПодсистем", "Ссылка");
	//Если Прочитать Тогда
	//	ЭтотОбъект.Прочитать();
	//КонецЕсли;
	ДеревоПриемник = ВариантыОтчетов.ДеревоПодсистемСформировать(ЭтотОбъект, Объект);
	ЗначениеВРеквизитФормы(ДеревоПриемник, "ДеревоПодсистем");
	//ОтчетыСервер.ВосстановитьВыделенныеСтроки(ЭтотОбъект, "ДеревоПодсистем", ВыделенныеСтроки);
	Возврат Истина;
КонецФункции

&НаСервере
Процедура ЗаполнитьИзПредопределенного(ВариантОбъект)
	
	ЭтоПредопределенный = ВариантыОтчетов.ЭтоПредопределенныйВариантОтчета(ВариантОбъект);
	
	Если Не ЭтоПредопределенный Тогда
		Возврат;
	КонецЕсли;
	
	ПредопределенныйВариант = ВариантОбъект.ПредопределенныйВариант.ПолучитьОбъект();
	
	ВариантОбъект.Наименование = ПредопределенныйВариант.Наименование;
	
	ПредставленияВарианта = ВариантОбъект.Представления.Выгрузить();
	ВариантОбъект.Представления.Очистить();
	ВариантОбъект.Представления.Загрузить(ПредопределенныйВариант.Представления.Выгрузить());
	
	Если ПустаяСтрока(ВариантОбъект.Описание) Тогда
		ВариантОбъект.Описание = ПредопределенныйВариант.Описание;
	Иначе
		ВариантОбъект.Представления.Сортировать("КодЯзыка");
		ПредставленияВарианта.Сортировать("КодЯзыка");
		Для каждого ПредставлениеВарианта Из ВариантОбъект.Представления Цикл
			ОписаниеВарианта = ПредставленияВарианта.Найти(ПредставлениеВарианта.КодЯзыка, "КодЯзыка");
			ПредставлениеВарианта.Описание = ОписаниеВарианта.Описание;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#Область ОбработкаОповещения

&НаКлиенте
Процедура РезультатВыбораВариантыОтчетовФормаРедактированиеВидимости(Результат, Параметры)  Экспорт
	
	//ПользователиВариантаРедактирование.Очистить();
	
	Структура = Результат;
	Если Структура = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ЕстьИзменения = Ложь;
	ПользователиВариантаРедактирование = Структура.Пользователи;	
	Если ПользователиВарианта.ДоступныеЗначения.Количество() <> 0 Тогда
		// Закешируем предыдущие значения
		ПользователиВарианта_Кеш = ПользователиВарианта.ДоступныеЗначения;
		// Значения после редактирования
		ПользователиВарианта = ВернутьНастройкиДоступностиВариантаОтчета(Объект.Ссылка, ПользователиВариантаРедактирование);

		Для Каждого ЭлементВарианта Из ПользователиВарианта.ДоступныеЗначения Цикл 
			НастройкиВарианта_Кеш = ПользователиВарианта_Кеш.НайтиПоЗначению(ЭлементВарианта.Значение);
			Если НЕ НастройкиВарианта_Кеш = Неопределено Тогда 
				Если НЕ НастройкиВарианта_Кеш.Пометка = ЭлементВарианта.Пометка Тогда 
					ЕстьИзменения = Истина;
					Прервать;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		
		Если ЕстьИзменения Тогда 
			Элементы.НастроитьВидимостьПользователей.Заголовок = ОписаниеПользователей();
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РезультатВыбораВариантыОтчетовФормаРедактированиеПодсистемы(Результат, Параметры)  Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоместитьДеревоЗначенийВформу(Результат.ДеревоПодсистем);
	Элементы.НастроитьПодсистемы.Заголовок = ОписаниеПодсистем();

КонецПроцедуры





#КонецОбласти

#КонецОбласти
